{
  "auto_mapping": {
    "base_model_class": "T5EncoderModelForSequenceClassification",
    "parent_library": "src.model_new"
  },
  "base_model_name_or_path": "Rostlab/prot_t5_xl_uniref50",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": [
    "custom_classifier_in",
    "custom_classifier_out"
  ],
  "peft_type": "LORA",
  "r": 8,
  "revision": null,
  "target_modules": [
    "q",
    "k",
    "v",
    "o"
  ],
  "task_type": null
}